In [1]:
import pandas as pd

In [2]:
# Reading the CSV File
df_exam = pd.read_csv("StudentsPerformance.csv")
df_exam.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

# 1. Adding a new Column

### 1.1 Adding a new Column with a scalar value

In [3]:
# Adding a new column to dataframe
df_exam["Language Score"]=70

In [4]:
df_exam

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,Language Score
0,female,group B,bachelor's degree,standard,none,72,72,74,70
1,female,group C,some college,standard,completed,69,90,88,70
2,female,group B,master's degree,standard,none,90,95,93,70
3,male,group A,associate's degree,free/reduced,none,47,57,44,70
4,male,group C,some college,standard,none,76,78,75,70
...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,70
996,male,group C,high school,free/reduced,none,62,55,55,70
997,female,group C,high school,free/reduced,completed,59,71,65,70
998,female,group D,some college,standard,completed,68,78,77,70
999,female,group D,some college,free/reduced,none,77,86,86,70

### 1.2 Adding a new column with an array

In [5]:
# Import numpy
import numpy as np

In [6]:
# Create an array of 1000 elements
language_score = np.arange(0, 1000)

In [7]:
len(language_score)

1000

In [8]:
# Adding new column to dataframe with an array
df_exam["language_score"]= language_score
df_exam

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,Language Score,language_score
0,female,group B,bachelor's degree,standard,none,72,72,74,70,0
1,female,group C,some college,standard,completed,69,90,88,70,1
2,female,group B,master's degree,standard,none,90,95,93,70,2
3,male,group A,associate's degree,free/reduced,none,47,57,44,70,3
4,male,group C,some college,standard,none,76,78,75,70,4
...,...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,70,995
996,male,group C,high school,free/reduced,none,62,55,55,70,996
997,female,group C,high school,free/reduced,completed,59,71,65,70,997
998,female,group D,some college,standard,completed,68,78,77,70,998
999,female,group D,some college,free/reduced,none,77,86,86,70,999

In [9]:
# Create random integer numbers between 1 and 100
int_language_score = np.random.randint(33, 100, size = 1000)

In [10]:
# Minimum and Maximum value inclusive and high value exclusive
print(min(int_language_score))
print(max(int_language_score))

33
99

In [11]:
# Adding new column to dataframe with an array
df_exam["language_score"]= int_language_score
df_exam

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,Language Score,language_score
0,female,group B,bachelor's degree,standard,none,72,72,74,70,84
1,female,group C,some college,standard,completed,69,90,88,70,58
2,female,group B,master's degree,standard,none,90,95,93,70,76
3,male,group A,associate's degree,free/reduced,none,47,57,44,70,93
4,male,group C,some college,standard,none,76,78,75,70,67
...,...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,70,79
996,male,group C,high school,free/reduced,none,62,55,55,70,37
997,female,group C,high school,free/reduced,completed,59,71,65,70,95
998,female,group D,some college,standard,completed,68,78,77,70,62
999,female,group D,some college,free/reduced,none,77,86,86,70,67

In [12]:
# Creating random float numbers
np.random.uniform(33, 100, size = 300)

array([78.11412243, 91.94952374, 83.32298118, 45.83402949, 89.52646818,
       33.59358929, 33.04585776, 65.36037215, 86.52513495, 90.80797127,
       81.60924861, 55.27504838, 37.70179889, 76.42973921, 84.64788152,
       42.58590088, 96.95792613, 90.77120432, 67.33258385, 85.00438351,
       81.3318007 , 55.22156348, 77.58527192, 68.16625937, 84.91225194,
       99.89618501, 98.0627436 , 71.57203376, 77.46918119, 78.03042836,
       89.84971616, 46.44372886, 44.14435254, 50.04804798, 47.2195602 ,
       75.21844378, 68.16833239, 90.88913431, 33.95568578, 84.61314482,
       96.92490394, 85.16395529, 74.5032617 , 49.04674343, 74.57905106,
       35.33971033, 68.93313384, 56.46182009, 59.26021695, 37.39161143,
       49.01440665, 53.28955832, 42.31975939, 71.13594434, 41.25480388,
       66.05111691, 82.7832167 , 87.2143968 , 82.90534919, 53.12380796,
       61.65617782, 94.97730675, 63.08283094, 45.96799687, 38.85561825,
       69.64140434, 81.64551785, 73.59264843, 33.82763851, 55.58552289,
       71.52967291, 40.02494466, 99.24065163, 52.53291058, 66.00430847,
       49.42743096, 35.38074193, 33.37539596, 80.4589077 , 77.02113191,
       94.24812973, 37.0919615 , 82.36059462, 48.12671823, 68.06046742,
       41.46803973, 99.18517579, 85.0656357 , 80.15557739, 83.29575234,
       56.90125336, 39.96853721, 63.44117537, 72.51536832, 42.11083037,
       65.59144381, 54.42307736, 83.9471992 , 91.90713297, 75.84488507,
       35.72587044, 80.88449452, 41.63823504, 77.20854543, 75.79471453,
       35.20075617, 64.68662728, 75.21974863, 90.51658731, 57.9324935 ,
       93.37209541, 65.94160399, 52.81150986, 39.087008  , 85.47057212,
       46.61542461, 50.6976515 , 96.12767522, 64.88527328, 48.65997179,
       87.49159003, 56.62093601, 83.88339964, 78.29037356, 33.86054475,
       79.08677533, 85.63229238, 74.48833509, 53.01987315, 80.91986948,
       45.626851  , 45.01306838, 50.28987219, 98.94183787, 72.84411727,
       59.63769526, 94.18233852, 92.48581041, 87.60523374, 35.34504674,
       47.10748353, 45.12194172, 47.67540644, 76.29910199, 98.25622241,
       94.76134832, 53.74410534, 98.88303932, 92.55866239, 46.98213051,
       87.65352829, 61.88492866, 73.75675307, 46.30368741, 61.07988088,
       66.14649767, 48.75716162, 53.13401545, 52.09555171, 81.5629365 ,
       53.29403603, 71.50684281, 48.2936636 , 39.96963475, 97.05962251,
       44.24540444, 94.56421026, 95.12439164, 69.60761761, 54.01872293,
       49.45616528, 76.27893845, 62.45211618, 55.84442328, 98.74647777,
       35.35040187, 96.66552542, 86.99690719, 94.9269182 , 53.84216881,
       37.19570725, 52.45697839, 39.52254844, 37.79726325, 83.66431268,
       45.84444243, 69.04763205, 65.74145368, 37.07484592, 49.94720038,
       67.57560684, 70.17970014, 46.98964624, 38.81286426, 82.67461347,
       41.16834351, 50.55230815, 86.94039088, 81.42547616, 43.74556001,
       72.56096004, 90.36388616, 43.31403995, 34.62760899, 59.89390999,
       55.13160957, 65.73169762, 35.66743082, 33.52256082, 92.23175677,
       66.51015142, 92.48112225, 74.00336857, 78.57646689, 47.62056113,
       53.51181326, 33.5643914 , 77.39580207, 57.32469671, 53.66130302,
       89.59411956, 94.13244239, 38.30206514, 68.22806559, 82.27037639,
       86.3048498 , 73.38601269, 57.45075157, 71.38014155, 50.95550218,
       99.10324226, 35.2768123 , 71.67741678, 67.04306792, 42.43120768,
       65.02099388, 93.3448074 , 60.67249036, 47.42316322, 91.58071851,
       58.41949583, 59.77679431, 94.82331804, 80.89936713, 49.89152897,
       72.15476979, 81.1697097 , 83.46142143, 39.63225433, 64.96732201,
       67.06096849, 52.18864199, 82.57963281, 90.22720698, 47.3352788 ,
       95.39973821, 66.96418385, 39.09575089, 82.26516184, 94.49400684,
       66.81514856, 72.95305035, 58.0576507 , 37.95464241, 95.0862812 ,
       88.15280204, 41.20115722, 44.41911076, 35.45379732, 63.11617526,
       36.07454157, 40.47077507, 92.71726514, 89.52667451, 52.70928925,
       99.27334393, 55.79894464, 59.96376383, 54.47683364, 76.20915028,
       92.02439411, 65.59400691, 62.26230551, 87.18207627, 83.83520855,
       79.00640594, 81.24302372, 59.29947862, 72.47173928, 59.91089253,
       73.19078359, 46.08707948, 69.63732827, 81.6643704 , 81.54133149,
       71.58963105, 36.90304945, 53.56064447, 98.17144138, 51.7059364 ])